Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
a = 4,8,15,16,42
pan_ser = pd.Series(a)
pan_ser

0     4
1     8
2    15
3    16
4    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
var_pd = [1,2,3,4,5,6,7,8,9,10]
pd.Series(var_pd)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
```
Name   | Age | Gender
---------------------
Alice  |25   |Female
Bob    |30   |Male
Claire |27   |Female
```
Then, print the DataFrame.

In [3]:
pd.read_csv("q1.csv")

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a two-dimensional data structure, like a table or spreadsheet, that can hold heterogeneous data. It is one of the primary data structures provided by the pandas library, designed to handle and manipulate data effectively. We can think of a DataFrame as a collection of Series, where each Series represents a column of the DataFrame.

On the other hand, a pandas.Series is a one-dimensional array-like object. It is similar to a list or a NumPy array but comes with additional functionality and flexibility. A Series can contain homogeneous data of any data type, such as integers, strings, or even objects.

Here's a simple example to illustrate the difference between a DataFrame and a Series:

Suppose we want to represent information about employees in a company. We can use a DataFrame to store this data:

In [10]:
import logging

logging.basicConfig(filename= "error.log", level= logging.INFO)
# Create a DataFrame
data = {
    'Name': ['Tridip', 'Suman', 'Abhijit', 'Sundar'],
    'Age': [28, 24, 22, 31],
    'Department': ['Python Developer', 'Data Engineer', 'Web Developer', 'Ml Engineer']
}

df = pd.DataFrame(data)
logging.info(df)

In this example, we have created a DataFrame with three columns: 'Name', 'Age', and 'Department'. Each column is represented by a pandas.Series.
Key differences between DataFrame and Series:

1. Dimensionality:
   - DataFrame: Two-dimensional (rows and columns)
   - Series: One-dimensional (single row or column)

2. Heterogeneity:
   - DataFrame: Can hold multiple data types in different columns.
   - Series: Typically holds a single data type (homogeneous).

3. Representation:
   - DataFrame: Tabular structure with rows and columns.
   - Series: Index with values (column name in case of Series within a DataFrame).

4. Functionality:
   - DataFrame: Provides functionality to work with multiple columns and rows simultaneously.
   - Series: Provides operations and methods for one-dimensional data manipulation.

In [12]:
# This is a DataFrame
data = {
    'Name': ['Tridip', 'Suman', 'Abhijit', 'Sundar'],
    'Age': [28, 24, 22, 31],
    'Department': ['Python Developer', 'Data Engineer', 'Web Developer', 'Ml Engineer']
}

df = pd.DataFrame(data)
logging.info(df)

# This is a series

logging.info(df['Name'])

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In pandas we can perfome verious types of functions, it has wide range of functions. Some commonly used functions are -

1. filter(): Allows you to filter rows based on certain conditions.
2. groupby(): Enables you to group data based on one or more columns and perform aggregate functions.
3. merge(): Combines two DataFrames based on a common key or index.
4. sort_values(): Sorts the DataFrame based on one or more columns.
5. drop(): Removes rows or columns from the DataFrame.
6. fillna(): Fills missing values in the DataFrame with specified values.
7. apply(): Applies a function to each element or row of the DataFrame.
8. pivot_table(): Creates a pivot table for data summarization.
9. map(): Applies a function to each element of a specific column.
10. rename(): Renames columns or index labels.

In [30]:
data = {
    'Name': ['Tridip', 'Suman', 'Abhijit', 'Sundar'],
    'Age': [28, 24, 22, 31],
    'Department': ['Python Developer', 'Data Engineer', 'Web Developer', 'Ml Engineer']
}

df = pd.DataFrame(data)
df

      Name  Age        Department
0   Tridip   28  Python Developer
1    Suman   24     Data Engineer
2  Abhijit   22     Web Developer
3   Sundar   31       Ml Engineer

In [54]:
df.filter(items=['Name','Age'])

      Name  Age
0   Tridip   28
1    Suman   24
2  Abhijit   22
3   Sundar   31

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Among the options given, the **Series** and **DataFrame** are mutable in nature.

1. **Series**: A pandas Series is mutable, which means we can modify its elements after creation. We can change the values of individual elements, add new elements, or delete existing ones.

2. **DataFrame**: A pandas DataFrame is also mutable. We can modify the data within the DataFrame, such as updating cell values, adding or removing rows/columns, and performing various data manipulations.

3. **Panel**: The Panel was **immutable**, meaning we couldn't modify its contents after creation.

To summarize, both the Series and DataFrame are mutable data structures in pandas, while the Panel (which is no longer commonly used) is immutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
import pandas as pd

Name = pd.Series(['Tridip', 'Suman', 'Abhijit', 'Sundar'])
Age =  pd.Series([28, 24, 22, 31])
Department =  pd.Series(['Python Developer', 'Data Engineer', 'Web Developer', 'Ml Engineer'])

db = {'Name' : Name,
      'Age' : Age,
      'Deparment' : Department
     }

df = pd.DataFrame(db)
df

      Name  Age         Deparment
0   Tridip   28  Python Developer
1    Suman   24     Data Engineer
2  Abhijit   22     Web Developer
3   Sundar   31       Ml Engineer

In this example, we first created three separate Series: Name, Age, and Department. Next, we combined these Series into a dictionary called data, where the keys of the dictionary represent the column names, and the corresponding values are the Series.

Finally, we used the pd.DataFrame() constructor and passed the data dictionary to create the DataFrame df. The resulting DataFrame now contains the information from the individual Series aligned by their indexes, creating a coherent tabular structure with three columns: 'Name', 'Age', and 'Department'. Each row represents information.